*subset : 기준이되는 컬럼 명을 넣음

*drop duplicates(subset)

In [27]:
import pandas as pd
import numpy as np
arr = np.array([1,2,1,2,2,3,3,3])
data = arr.reshape(4,2)
df = pd.DataFrame(data, columns = ['a','b'])
df

   a  b
0  1  2
1  1  2
2  2  3
3  3  3

In [5]:
df1 = df.copy()
df1.drop_duplicates()

   a  b
0  1  2
2  2  3
3  3  3

In [28]:
df2 = df.copy()
df2.drop_duplicates(subset=['b']) #default = first

   a  b
0  1  2
2  2  3

In [11]:
df3 = df.copy()
df3.drop_duplicates(subset='b',keep='last')

   a  b
1  1  2
3  3  3

In [78]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [79]:
titanic['sex'] = titanic['sex'].replace({'male':0,'female':1})

In [98]:
titanic.rename(columns={'sex':'gender','class':'c_level'},inplace=True)

In [99]:
titanic.rename(columns=str.lower,inplace=True)

In [101]:
df = titanic[['survived','pclass','gender','c_level']]
new_order = ['pclass','gender','c_level','survived']
df = df[new_order]

In [102]:
# df['gender'].replace({0:'male',1:'female'},inplace=True)
df['gender'].replace([1,0],['female','male'],inplace=True)

In [103]:
#encoding?
#male/female -> encoding. 숫자로 바꿔줌
# Label enconding
# 희소행렬? 01 -> one hot encoding

In [105]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
features = ['gender','c_level']
for feature in features:
    df[feature] = le.fit_transform(df[feature]) #인코딩 실행됨. -학습: fit함수를 사용
df.head()

   pclass  gender  c_level  survived
0       3       1        2         0
1       1       0        0         1
2       3       0        2         1
3       1       0        0         1
4       3       1        2         0

In [106]:
df.gender.value_counts()

1    577
0    314
Name: gender, dtype: int64

In [107]:
df.c_level.value_counts()

2    491
0    216
1    184
Name: c_level, dtype: int64

In [113]:
df1= titanic[['embarked','who','adult_male']]
df1

    embarked    who  adult_male
0          S    man        True
1          C  woman       False
2          S  woman       False
3          S  woman       False
4          S    man        True
..       ...    ...         ...
886        S    man        True
887        S  woman       False
888        S  woman       False
889        C    man        True
890        Q    man        True

[891 rows x 3 columns]

In [114]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
features  = ['embarked','who','adult_male']
for feature in features:
    df1[feature] = le.fit_transform(df1[feature])
df1.head()

<ipython-input-114-f5018337a3a7>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1[feature] = le.fit_transform(df1[feature])

   embarked  who  adult_male
0         2    1           1
1         0    2           0
2         2    2           0
3         2    2           0
4         2    1           1

In [118]:
df1.value_counts()

embarked  who  adult_male
2         1    1             410
          2    0             174
0         1    1              90
          2    0              60
2         0    0              60
1         1    1              37
          2    0              35
0         0    0              18
1         0    0               5
3         2    0               2
dtype: int64

In [127]:
tt = sns.load_dataset('titanic')
tt.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [131]:
df= tt[['sex','class']]
df1 = df.copy()
df1 = df1.rename(columns={'class':'c_level'})

In [132]:
pd.get_dummies(df1).head()

   sex_female  sex_male  c_level_First  c_level_Second  c_level_Third
0           0         1              0               0              1
1           1         0              1               0              0
2           1         0              0               0              1
3           1         0              1               0              0
4           0         1              0               0              1

In [14]:
students = [('jack', 34, 'Sydeny'),
            ('Riti', 30, 'Delhi'),
            ('Aadi', 16, 'New York'),
            ('Riti', 30, 'Delhi'),
            ('Riti', 30, 'Delhi'),
            ('Riti', 30, 'Mumbai'),
            ('Aadi', 40, 'London'),
            ('Sachin', 30, 'Delhi')
            ]

In [15]:
dfObj = pd.DataFrame(students, columns=['Name', 'Age', 'City'])

In [16]:
dfObj

     Name  Age      City
0    jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
3    Riti   30     Delhi
4    Riti   30     Delhi
5    Riti   30    Mumbai
6    Aadi   40    London
7  Sachin   30     Delhi

In [19]:
duplicateRowsDF = dfObj[dfObj.duplicated()] # except first
duplicateRowsDF

   Name  Age   City
3  Riti   30  Delhi
4  Riti   30  Delhi

In [21]:
duplicateRowsDF = dfObj[dfObj.duplicated(keep='last')] # except last
duplicateRowsDF

   Name  Age   City
1  Riti   30  Delhi
3  Riti   30  Delhi

In [26]:
duplicateRowsDF = dfObj[dfObj.duplicated(['Age', 'City'])]
duplicateRowsDF

     Name  Age   City
3    Riti   30  Delhi
4    Riti   30  Delhi
7  Sachin   30  Delhi

In [30]:
dfObj.duplicated()

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool